app/Controllers/PaymentController.php


        // insert en BD
        $orderM = new OrdersModel();
        $idOrder = $orderM->insert($data);
        $lastOrder = $orderM->find($idOrder);
---
INSERT INTO `orders` (`amount`, `mac`, `ip`, `email`) VALUES ('10000', 'df:34:67:09:ab:23', '192.168.0.7', 'arnaldoespinoza1@ppp.com')
SELECT *
FROM `orders`
WHERE `orders`.`id` = 1